import { allSeperatedWords } from "./allSeperatedWords";

const words = Array.from(
  new Set([
    "以及",
    "至",
    "到",
    "及",
    "和",
    "或",
    "在",
    "於",
    "是",
    "係",
    "為",
    "上",
    "下",
    "左",
    "右",
    "前",
    "後",
    "內",
    "外",
    "裡",
    "之",
    "的"
  ])
);

export const restrictedLastWords = [...words, ...allSeperatedWords().split("|")]
  .sort((a, b) => b.length - a.length)
  .join("|");

export const wordTable = {
  和: [
    "共",
    "混",
    "飽",
    "調",
    "零",
    "搆",
    "構",
    "回",
    "綬",
    "攪",
    "親",
    "融",
    "總",
    "溫"
  ],
  至: ["分", "冬", "夏"],
  到: ["報", "辦", "逹", "打", "獨", "踢", "不", "趕", "料", "簽", "直", "遇"],
  及: ["波", "遍", "不可", "不", "普", "奈", "埃", "企", "觸"],
  或: ["不可"],
  在: ["自", "不", "內", "好", "潛", "現", "實", "正", "身", "存", "所"],
  於: ["致", "至", "對", "等", "在"],
  是: ["本", "便", "不", "國", "總", "算", "也", "要", "又", "於"],
  係: ["闗", "干", "介", "氏"],
  為: ["作", "以", "可", "行", "相", "人", "所", "無"],
  上: ["北", "不"],
  下: ["部", "趴", "皮", "高"],
  左: [],
  右: [],
  前: [],
  後: [],
  內: [],
  外: [],
  裡: []
};
